papers/privacy/presentations/L12_global/global_games.org
#+TITLE:    Game Theory: Global Games
#+AUTHOR:    Christoph Schottmüller
#+EMAIL:     christoph@worknotebook.home
#+DATE:       
#+DESCRIPTION:
#+KEYWORDS:


#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger,allowframebreaks]
#+BEAMER_FRAME_LEVEL: 2
#+latex_header: \mode<beamer>{\useinnertheme{rounded}\usecolortheme{rose}\usecolortheme{dolphin}\setbeamertemplate{navigation symbols}{}\setbeamertemplate{footline}[frame number]{}}
#+latex_header: \mode<beamer>{\usepackage{amsmath}\usepackage{ae,aecompl,sgamevar}}
#+LATEX_HEADER:\let\oldframe\frame\renewcommand\frame[1][allowframebreaks]{\oldframe[#1]}
#+LATEX_HEADER: \setbeamertemplate{frametitle continuation}[from second]



* Global Games: Stag Hunt
** Stag Hunt
*** Example 						     :B_exampleblock:
    :PROPERTIES:
    :BEAMER_env: exampleblock
    :END:
     \begin{figure}[h]
       \centering
      \begin{game}{2}{2}
             \>  H2 \> S2\\
        H1   \> 3,3 \> 3,0\\
       S1   \> 0,3 \> 4,4
      \end{game}
     \caption{Stag hunt}
   \end{figure}

- two pure NE (+ 1 mixed NE) $\Rightarrow$ which should we predict as outcome of the game?

** Two approaches
- payoff dominance
- risk dominance
   - multiply the deviation losses of both players in a given equilibrium and select the equilibrium where the product is highest ($here: (3-0)^2>(4-3)^2$)
   - intuitively: which equilibrium is supported by a larger set of beliefs? i.e. if the other player mixes $(1/2,1/2)$, what do you choose?

** Global Games: Carlsson and van Damme (1993)
:PROPERTIES:
:BEAMER_opt: allowframebreaks,label=
:END:

 \begin{figure}[h]
  \centering
  \begin{game}{2}{2}
  \> H2 \> S2\\
  H1   \>$x,x$\>$x,0$\\
  S1 \>$0,x$\>$4,4$
 \end{game}
 \end{figure}

- state of the world $x\in[-1,5]$ is unknown to players
- assume each state is equally likely ($x$ distributed uniformly on $[-1,5]$) 
- both players observe a private signal $x_i\in[x-\varepsilon ,x+\varepsilon ]$ for some $\varepsilon >0$
- assume the two $x_i$ are independently drawn from a uniform distribution on $[x-\varepsilon ,x+\varepsilon ]$
- interpretation: players are not exactly sure which game they play

\framebreak

assume $\varepsilon=0.1$
- you get a signal $x_1=-0.5$
   - what do you believe about the state of the world?
   - what do you believe about the other player's signal?
   - which action should you take?

- you get signal $x_1<0$
   - \dots

- you get a signal $x_1=0$
   - \dots

- what is the biggest $x_1$ for which you play $S1$ for sure?

\framebreak
- you get signal $x_1>4$
   - what do you believe about the state of the world?
   - what do you believe about the other player's signal?
   - which action should you take?
 
- what is the smallest $x_1$ for which you play $H1$ for sure?

\framebreak

- result does not depend on $\varepsilon =0.1$ but is true for any $\varepsilon >0$ that is not too big 
- if $\varepsilon \rightarrow 0$, we get a unique prediction for any stag hunt game
- Carlsson and van Damme show that the global game approach selects the risk dominant equilibrium in $2\times2$ games with two strict equilibria
- result does not depend on uniform distributions

