papers/privacy/presentations/L12_global/global_games.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-16 Di 17:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Game Theory: Global Games</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christoph Schottmüller" />
</head>
<body>
<div id="preamble" class="status">
<div id="preamble" class="status">
  <div class="banner">

    <p style="text-align: justify;">
      
  <a id="subtitle" href="https://schottmueller.github.io/index.html">Home</a>
  <a id="subtitle" href="https://schottmueller.github.io/research.html">Research</a>
  <a id="subtitle" href="https://schottmueller.github.io/teaching.html">Teaching</a>
  <a id="subtitle" href="https://schottmueller.github.io/misc.html">Misc</a>

  <span> </span>
</div>

</p>

</div>
</div>
</div>
<div id="content">
<h1 class="title">Game Theory: Global Games</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd40ab5a">1. Global Games: Stag Hunt</a>
<ul>
<li><a href="#org60e0f01">1.1. Stag Hunt</a></li>
<li><a href="#org82949e5">1.2. Two approaches</a></li>
<li><a href="#orgdf60849">1.3. Global Games: Carlsson and van Damme (1993)</a></li>
<li><a href="#org0328525">1.4. Intermezzo: Cutoff Strategies</a></li>
<li><a href="#orgf5f6ba5">1.5. Global Games and iterative elimination of strictly dominated strategies</a></li>
<li><a href="#org52f210d">1.6. Global Games and Knowledge</a></li>
</ul>
</li>
<li><a href="#orgaaac2fe">2. An investment example</a>
<ul>
<li><a href="#org322a741">2.1. An investment example</a></li>
</ul>
</li>
<li><a href="#org37d7de1">3. Revision questions and exercises</a>
<ul>
<li><a href="#orgb5d119f">3.1. Review questions</a></li>
<li><a href="#org19caa05">3.2. Exercises</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-orgd40ab5a" class="outline-2">
<h2 id="orgd40ab5a"><span class="section-number-2">1</span> Global Games: Stag Hunt</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org60e0f01" class="outline-3">
<h3 id="org60e0f01"><span class="section-number-3">1.1</span> Stag Hunt</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<ol class="org-ol">
<li><a id="org2dbd033"></a>Example&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_exampleblock">B_exampleblock</span></span><br />
<div class="outline-text-4" id="text-1-1-1">
  \begin{figure}[h]
    \centering
   \begin{game}{2}{2}
          \>  H2 \> S2\\
     H1   \> 3,3 \> 3,0\\
    S1   \> 0,3 \> 4,4
   \end{game}
  \caption{Stag hunt}
\end{figure}

<ul class="org-ul">
<li>two pure NE (+ 1 mixed NE) \(\Rightarrow\) which should we predict as outcome of the game?</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org82949e5" class="outline-3">
<h3 id="org82949e5"><span class="section-number-3">1.2</span> Two approaches</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>payoff dominance</li>
<li>risk dominance
<ul class="org-ul">
<li>multiply the deviation losses of both players in a given equilibrium and select the equilibrium where the product is highest (\(here: (3-0)^2>(4-3)^2\))</li>
<li>intuitively: which equilibrium is supported by a larger set of beliefs? i.e. if the other player mixes \((1/2,1/2)\), what do you choose?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgdf60849" class="outline-3">
<h3 id="orgdf60849"><span class="section-number-3">1.3</span> Global Games: Carlsson and van Damme (1993)</h3>
<div class="outline-text-3" id="text-1-3">
\begin{figure}[h]
 \centering
 \begin{game}{2}{2}
 \> H2 \> S2\\
 H1   \>$x,x$\>$x,0$\\
 S1 \>$0,x$\>$4,4$
\end{game}
\end{figure}

<ul class="org-ul">
<li>state of the world \(x\in[-1,5]\) is unknown to players</li>
<li>assume each state is equally likely (\(x\) distributed uniformly on \([-1,5]\))</li>
<li>both players observe a private signal \(x_i\in[x-\varepsilon ,x+\varepsilon ]\) for some \(\varepsilon >0\)</li>
<li>assume the two \(x_i\) are independently drawn from a uniform distribution on \([x-\varepsilon ,x+\varepsilon ]\)</li>
<li>interpretation: players are not exactly sure which game they play</li>
</ul>

<p>
\framebreak
</p>

<p>
assume \(\varepsilon=0.1\)
</p>
<ul class="org-ul">
<li>you get a signal \(x_1=-0.5\)
<ul class="org-ul">
<li>what do you believe about the state of the world?</li>
<li>what do you believe about the other player's signal?</li>
<li>which action should you take?</li>
</ul></li>

<li>you get signal \(x_1<0\)
<ul class="org-ul">
<li>&hellip;</li>
</ul></li>

<li>you get a signal \(x_1=0\)
<ul class="org-ul">
<li>&hellip;</li>
</ul></li>

<li>what is the biggest \(x_1\) for which you play \(S1\) for sure?</li>
</ul>

<p>
\framebreak
</p>
<ul class="org-ul">
<li>you get signal \(x_1>4\)
<ul class="org-ul">
<li>what do you believe about the state of the world?</li>
<li>what do you believe about the other player's signal?</li>
<li>which action should you take?</li>
</ul></li>

<li>what is the smallest \(x_1\) for which you play \(H1\) for sure?</li>
</ul>

<p>
\framebreak
</p>

<ul class="org-ul">
<li>result does not depend on \(\varepsilon =0.1\) but is true for any \(\varepsilon >0\) that is not too big</li>
<li>if \(\varepsilon \rightarrow 0\), we get a unique prediction for any stag hunt game</li>
<li>Carlsson and van Damme show that the global game approach selects the risk dominant equilibrium in \(2\times2\) games with two strict equilibria</li>
<li>result does not depend on uniform distributions</li>
</ul>
</div>
</div>
