papers/privacy/presentations/L12_global/global_games.tex
% Created 2015-11-18 Wed 09:32
\documentclass[bigger,allowframebreaks]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\mode<beamer>{\useinnertheme{rounded}\usecolortheme{rose}\usecolortheme{dolphin}\setbeamertemplate{navigation symbols}{}\setbeamertemplate{footline}[frame number]{}}
\mode<beamer>{\usepackage{amsmath}\usepackage{ae,aecompl,sgamevar}}
\let\oldframe\frame\renewcommand\frame[1][allowframebreaks]{\oldframe[#1]}
\setbeamertemplate{frametitle continuation}[from second]
\usetheme{default}
\author{Christoph Schottmüller}
\date{}
\title{Game Theory: Global Games}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}




\section{Global Games: Stag Hunt}
\label{sec-1}
\begin{frame}[label=sec-1-1]{Stag Hunt}
\begin{exampleblock}{Example}
  \begin{figure}[h]
    \centering
   \begin{game}{2}{2}
          \>  H2 \> S2\\
     H1   \> 3,3 \> 3,0\\
    S1   \> 0,3 \> 4,4
   \end{game}
  \caption{Stag hunt}
\end{figure}

\begin{itemize}
\item two pure NE (+ 1 mixed NE) $\Rightarrow$ which should we predict as outcome of the game?
\end{itemize}
\end{exampleblock}
\end{frame}

\begin{frame}[label=sec-1-2]{Two approaches}
\begin{itemize}
\item payoff dominance
\item risk dominance
\begin{itemize}
\item multiply the deviation losses of both players in a given equilibrium and select the equilibrium where the product is highest ($here: (3-0)^2>(4-3)^2$)
\item intuitively: which equilibrium is supported by a larger set of beliefs? i.e. if the other player mixes $(1/2,1/2)$, what do you choose?
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[allowframebreaks,label=]{Global Games: Carlsson and van Damme (1993)}

\begin{figure}[h]
 \centering
 \begin{game}{2}{2}
 \> H2 \> S2\\
 H1   \>$x,x$\>$x,0$\\
 S1 \>$0,x$\>$4,4$
\end{game}
\end{figure}

\begin{itemize}
\item state of the world $x\in[-1,5]$ is unknown to players
\item assume each state is equally likely ($x$ distributed uniformly on $[-1,5]$)
\item both players observe a private signal $x_i\in[x-\varepsilon ,x+\varepsilon ]$ for some $\varepsilon >0$
\item assume the two $x_i$ are independently drawn from a uniform distribution on $[x-\varepsilon ,x+\varepsilon ]$
\item interpretation: players are not exactly sure which game they play
\end{itemize}

\framebreak

assume $\varepsilon=0.1$
\begin{itemize}
\item you get a signal $x_1=-0.5$
\begin{itemize}
\item what do you believe about the state of the world?
\item what do you believe about the other player's signal?
\item which action should you take?
\end{itemize}

\item you get signal $x_1<0$
\begin{itemize}
\item \dots{}
\end{itemize}

\item you get a signal $x_1=0$
\begin{itemize}
\item \dots{}
\end{itemize}

\item what is the biggest $x_1$ for which you play $S1$ for sure?
\end{itemize}

\framebreak
\begin{itemize}
\item you get signal $x_1>4$
\begin{itemize}
\item what do you believe about the state of the world?
\item what do you believe about the other player's signal?
\item which action should you take?
\end{itemize}

\item what is the smallest $x_1$ for which you play $H1$ for sure?
\end{itemize}

\framebreak

\begin{itemize}
\item result does not depend on $\varepsilon =0.1$ but is true for any $\varepsilon >0$ that is not too big
\item if $\varepsilon \rightarrow 0$, we get a unique prediction for any stag hunt game
\item Carlsson and van Damme show that the global game approach selects the risk dominant equilibrium in $2\times2$ games with two strict equilibria
\item result does not depend on uniform distributions
\end{itemize}
\end{frame}
