papers/privacy/presentations/L12_global/global_games.org
** Intermezzo: Cutoff Strategies
:PROPERTIES:
:BEAMER_opt: allowframebreaks,label=
:END:

- A strategy in the global game is a function that associates an action with each signal
$$s_i(x_i): \;[-1,5]\rightarrow\{Hi,Si\}$$
- we define a /cutoff strategy/ with cutoff $\bar s$ as
$$ s_i(x_i)=\begin{cases}
Hi & \text{ if }x_i\geq \bar s_i\\
Si & \text{ if }x_i<\bar s_i
\end{cases}$$

\framebreak

if $i$ plays a cutoff strategy with cutoff $\bar s_i\in(-\varepsilon,4+\varepsilon)$ which cutoff strategy is a best response of $j$ (i.e. what is the best response cutoff $\bar s_j$)?
- if $j$ gets the signal $x_j=\bar s_j$, he should be indifferent between Hj and Sj
- can $j$ be indifferent if $\bar s_i\leq \bar s_j-2\varepsilon$? 
- can $j$ be indifferent if $\bar s_i\geq \bar s_j+2\varepsilon$?
- after observing $x_j$, what does $j$ believe about the distribution of $x_i$?
# triangle distribution
- can $\bar s_j=\bar s_i$ be a best response? what would $j$ think about the probability that $i$ plays Si when receiving signal $x_j=\bar s_j$ in this case?
# equal probability on Hi and Si, therefore only a best response if \bar s_i=2
- if $\bar s_i<2$, (i) should $\bar s_j$ be above or below $\bar s_i$ to make $j$ indifferent? (ii) could $\bar s_j>2$ make $j$ indifferent?
# above: otherwise probability of Si is bigger than 0.5 and then $j$ strictly prefers to play Sj (which then gives an expected payoff higher than 2)
# no: then the cutoff type thinks that states above 2 are likely and i is likely to play Hi; hence Hj is strictly better than Sj
** Global Games and iterative elimination of strictly dominated strategies
- back to the global game: which strategies are strictly dominated?
# all strategies that play Hi when $x_i<-\epsilon$ or Si when $x_i>4+\epsilon$
- given that the other player does not play strictly dominated strategies, which of my strategies are strictly dominated?
- iterative elimination of dominated strategies
# graph as in Morris/Shin
*** Result							    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
Iterative elimination of strictly dominated strategies leads to a unique prediction in the global game.


** Global Games and Knowledge 
- if $i$ receives signal $x_i$, what does he know about
   - state of the world
   - which states $j$ considers possible
   - which states $j$ thinks $i$ considers possible
   - \dots
# far away states (where dominant action) are relevant
- global games capture -- in a tractable way -- the idea that 
   - payoffs are not common knowledge
   - beliefs are not common knowledge



* An investment example
** An investment example
:PROPERTIES:
:BEAMER_opt: allowframebreaks,label=
:END:
- Coordination problems as above are relevant in many settings
- 2 investors
- investors decide (simultaneously) whether to invest in a project or not ($A_i=\{I,N\}$)
- investing carries a cost of 1
- the project succeeds only if both invest
- a successfull project generates revenue of 4 which is equally split
- not investing in the project gives a payoff of $r$
\begin{figure}[h]
       \centering
      \begin{game}{2}{2}
             \>  I \> N\\
       I  \> $1,1$ \> $-1,r$\\
       N   \> $r,-1$ \> $r,r$
      \end{game}
     \caption{Investment game}
   \end{figure}

- for which values of $r$ does an investor have a dominant strategy?
- say, both investors have the prior that $r$ is distributed uniformly on $[-2,2]$ and receive a private signal $x_i$ which is uniformly distributed on $[r-0.1,r+0.1]$
- what is the belief of $i$ after observing $x_i$ concerning 
   - the state $r$
   - the signal of the other investor?
- for which values of $x_i$ is $I$ strictly dominated by $N$?
- given that the other investor does not use dominated strategies, why is $I$ strictly dominated by $N$ for values of $x_i$ slightly below 1?
- What is the equilibrium (in cutoff strategies)?


* Revision questions and exercises
** Review questions
- What is the Stag Hunt game and what is the basic problem described by this game?
- What is the main game theoretic challenge in the Stag Hunt?
- What is a global game? 
- What does a player know in a global game? What is common knowledge?
- How does the global game approach select an equilibrium?
- Why is it surprising that the global game approach selects a unique equilibrium?
- reading: Carlsson and van Damme, ECTA 93, p. 989-993; *Morris and Shin, 2000, p. 1-15; *Morris and Shin, 1998

