papers/privacy/presentations/L12_global/global_games.html

<div id="outline-container-org0328525" class="outline-3">
<h3 id="org0328525"><span class="section-number-3">1.4</span> Intermezzo: Cutoff Strategies</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>A strategy in the global game is a function that associates an action with each signal</li>
</ul>
<p>
\[s_i(x_i): \;[-1,5]\rightarrow\{Hi,Si\}\]
</p>
<ul class="org-ul">
<li>we define a <i>cutoff strategy</i> with cutoff \(\bar s\) as</li>
</ul>
<p>
\[ s_i(x_i)=\begin{cases}
Hi & \text{ if }x_i\geq \bar s_i\\
Si & \text{ if }x_i<\bar s_i
\end{cases}\]
</p>

<p>
\framebreak
</p>

<p>
if \(i\) plays a cutoff strategy with cutoff \(\bar s_i\in(-\varepsilon,4+\varepsilon)\) which cutoff strategy is a best response of \(j\) (i.e. what is the best response cutoff \(\bar s_j\))?
</p>
<ul class="org-ul">
<li>if \(j\) gets the signal \(x_j=\bar s_j\), he should be indifferent between Hj and Sj</li>
<li>can \(j\) be indifferent if \(\bar s_i\leq \bar s_j-2\varepsilon\)?</li>
<li>can \(j\) be indifferent if \(\bar s_i\geq \bar s_j+2\varepsilon\)?</li>
<li>after observing \(x_j\), what does \(j\) believe about the distribution of \(x_i\)?</li>
</ul>

<ul class="org-ul">
<li>can \(\bar s_j=\bar s_i\) be a best response? what would \(j\) think about the probability that \(i\) plays Si when receiving signal \(x_j=\bar s_j\) in this case?</li>
</ul>

<ul class="org-ul">
<li>if \(\bar s_i<2\), (i) should \(\bar s_j\) be above or below \(\bar s_i\) to make \(j\) indifferent? (ii) could \(\bar s_j>2\) make \(j\) indifferent?</li>
</ul>
</div>
</div>
<div id="outline-container-orgf5f6ba5" class="outline-3">
<h3 id="orgf5f6ba5"><span class="section-number-3">1.5</span> Global Games and iterative elimination of strictly dominated strategies</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>back to the global game: which strategies are strictly dominated?</li>
</ul>

<ul class="org-ul">
<li>given that the other player does not play strictly dominated strategies, which of my strategies are strictly dominated?</li>
<li>iterative elimination of dominated strategies</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgffdc84f"></a>Result&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_block">B_block</span></span><br />
<div class="outline-text-4" id="text-1-5-1">
<p>
Iterative elimination of strictly dominated strategies leads to a unique prediction in the global game.
</p>
</div>
</li>
</ol>
</div>


<div id="outline-container-org52f210d" class="outline-3">
<h3 id="org52f210d"><span class="section-number-3">1.6</span> Global Games and Knowledge</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>if \(i\) receives signal \(x_i\), what does he know about
<ul class="org-ul">
<li>state of the world</li>
<li>which states \(j\) considers possible</li>
<li>which states \(j\) thinks \(i\) considers possible</li>
<li>&hellip;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>global games capture &#x2013; in a tractable way &#x2013; the idea that 
<ul class="org-ul">
<li>payoffs are not common knowledge</li>
<li>beliefs are not common knowledge</li>
</ul></li>
</ul>
</div>
</div>
</div>



<div id="outline-container-orgaaac2fe" class="outline-2">
<h2 id="orgaaac2fe"><span class="section-number-2">2</span> An investment example</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org322a741" class="outline-3">
<h3 id="org322a741"><span class="section-number-3">2.1</span> An investment example</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Coordination problems as above are relevant in many settings</li>
<li>2 investors</li>
<li>investors decide (simultaneously) whether to invest in a project or not (\(A_i=\{I,N\}\))</li>
<li>investing carries a cost of 1</li>
<li>the project succeeds only if both invest</li>
<li>a successfull project generates revenue of 4 which is equally split</li>
<li>not investing in the project gives a payoff of \(r\)</li>
</ul>
\begin{figure}[h]
       \centering
      \begin{game}{2}{2}
             \>  I \> N\\
       I  \> $1,1$ \> $-1,r$\\
       N   \> $r,-1$ \> $r,r$
      \end{game}
     \caption{Investment game}
   \end{figure}

<ul class="org-ul">
<li>for which values of \(r\) does an investor have a dominant strategy?</li>
<li>say, both investors have the prior that \(r\) is distributed uniformly on \([-2,2]\) and receive a private signal \(x_i\) which is uniformly distributed on \([r-0.1,r+0.1]\)</li>
<li>what is the belief of \(i\) after observing \(x_i\) concerning 
<ul class="org-ul">
<li>the state \(r\)</li>
<li>the signal of the other investor?</li>
</ul></li>
<li>for which values of \(x_i\) is \(I\) strictly dominated by \(N\)?</li>
<li>given that the other investor does not use dominated strategies, why is \(I\) strictly dominated by \(N\) for values of \(x_i\) slightly below 1?</li>
<li>What is the equilibrium (in cutoff strategies)?</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org37d7de1" class="outline-2">
<h2 id="org37d7de1"><span class="section-number-2">3</span> Revision questions and exercises</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb5d119f" class="outline-3">
<h3 id="orgb5d119f"><span class="section-number-3">3.1</span> Review questions</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>What is the Stag Hunt game and what is the basic problem described by this game?</li>
<li>What is the main game theoretic challenge in the Stag Hunt?</li>
<li>What is a global game?</li>
<li>What does a player know in a global game? What is common knowledge?</li>
<li>How does the global game approach select an equilibrium?</li>
<li>Why is it surprising that the global game approach selects a unique equilibrium?</li>
<li>reading: Carlsson and van Damme, ECTA 93, p. 989-993; *Morris and Shin, 2000, p. 1-15; *Morris and Shin, 1998</li>
</ul>
</div>
</div>
