papers/privacy/presentations/L12_global/global_games.tex

\begin{frame}[allowframebreaks,label=]{Intermezzo: Cutoff Strategies}

\begin{itemize}
\item A strategy in the global game is a function that associates an action with each signal
\end{itemize}
$$s_i(x_i): \;[-1,5]\rightarrow\{Hi,Si\}$$
\begin{itemize}
\item we define a \emph{cutoff strategy} with cutoff $\bar s$ as
\end{itemize}
$$ s_i(x_i)=\begin{cases}
Hi & \text{ if }x_i\geq \bar s_i\\
Si & \text{ if }x_i<\bar s_i
\end{cases}$$

\framebreak

if $i$ plays a cutoff strategy with cutoff $\bar s_i\in(-\varepsilon,4+\varepsilon)$ which cutoff strategy is a best response of $j$ (i.e. what is the best response cutoff $\bar s_j$)?
\begin{itemize}
\item if $j$ gets the signal $x_j=\bar s_j$, he should be indifferent between Hj and Sj
\item can $j$ be indifferent if $\bar s_i\leq \bar s_j-2\varepsilon$?
\item can $j$ be indifferent if $\bar s_i\geq \bar s_j+2\varepsilon$?
\item after observing $x_j$, what does $j$ believe about the distribution of $x_i$?
\end{itemize}
\begin{itemize}
\item can $\bar s_j=\bar s_i$ be a best response? what would $j$ think about the probability that $i$ plays Si when receiving signal $x_j=\bar s_j$ in this case?
\end{itemize}
\begin{itemize}
\item if $\bar s_i<2$, (i) should $\bar s_j$ be above or below $\bar s_i$ to make $j$ indifferent? (ii) could $\bar s_j>2$ make $j$ indifferent?
\end{itemize}
\end{frame}
\begin{frame}[label=sec-1-5]{Global Games and iterative elimination of strictly dominated strategies}
\begin{itemize}
\item back to the global game: which strategies are strictly dominated?
\end{itemize}
\begin{itemize}
\item given that the other player does not play strictly dominated strategies, which of my strategies are strictly dominated?
\item iterative elimination of dominated strategies
\end{itemize}
\begin{block}{Result}
Iterative elimination of strictly dominated strategies leads to a unique prediction in the global game.
\end{block}
\end{frame}


\begin{frame}[label=sec-1-6]{Global Games and Knowledge}
\begin{itemize}
\item if $i$ receives signal $x_i$, what does he know about
\begin{itemize}
\item state of the world
\item which states $j$ considers possible
\item which states $j$ thinks $i$ considers possible
\item \dots{}
\end{itemize}
\end{itemize}
\begin{itemize}
\item global games capture -- in a tractable way -- the idea that 
\begin{itemize}
\item payoffs are not common knowledge
\item beliefs are not common knowledge
\end{itemize}
\end{itemize}
\end{frame}



\section{An investment example}
\label{sec-2}
\begin{frame}[allowframebreaks,label=]{An investment example}
\begin{itemize}
\item Coordination problems as above are relevant in many settings
\item 2 investors
\item investors decide (simultaneously) whether to invest in a project or not ($A_i=\{I,N\}$)
\item investing carries a cost of 1
\item the project succeeds only if both invest
\item a successfull project generates revenue of 4 which is equally split
\item not investing in the project gives a payoff of $r$
\end{itemize}
\begin{figure}[h]
       \centering
      \begin{game}{2}{2}
             \>  I \> N\\
       I  \> $1,1$ \> $-1,r$\\
       N   \> $r,-1$ \> $r,r$
      \end{game}
     \caption{Investment game}
   \end{figure}

\begin{itemize}
\item for which values of $r$ does an investor have a dominant strategy?
\item say, both investors have the prior that $r$ is distributed uniformly on $[-2,2]$ and receive a private signal $x_i$ which is uniformly distributed on $[r-0.1,r+0.1]$
\item what is the belief of $i$ after observing $x_i$ concerning 
\begin{itemize}
\item the state $r$
\item the signal of the other investor?
\end{itemize}
\item for which values of $x_i$ is $I$ strictly dominated by $N$?
\item given that the other investor does not use dominated strategies, why is $I$ strictly dominated by $N$ for values of $x_i$ slightly below 1?
\item What is the equilibrium (in cutoff strategies)?
\end{itemize}
\end{frame}


\section{Revision questions and exercises}
\label{sec-3}
\begin{frame}[label=sec-3-1]{Review questions}
\begin{itemize}
\item What is the Stag Hunt game and what is the basic problem described by this game?
\item What is the main game theoretic challenge in the Stag Hunt?
\item What is a global game?
\item What does a player know in a global game? What is common knowledge?
\item How does the global game approach select an equilibrium?
\item Why is it surprising that the global game approach selects a unique equilibrium?
\item reading: Carlsson and van Damme, ECTA 93, p. 989-993; *Morris and Shin, 2000, p. 1-15; *Morris and Shin, 1998
\end{itemize}
\end{frame}
