papers/privacy/presentations/L12_global/global_games.org
** Exercises
:PROPERTIES:
:BEAMER_opt: allowframebreaks,label=
:END:

- Compare equilibrium selection by the global game approach with equilibrium refinement by perfect equilibrium. 
# perturbation: actions vs. payoffs; objective: select 1 equilibrium vs. ruling out unreasonable equilibria; solution concept in perturbed game: rationalizability (uniqueness!) vs. Nash equilibrium
- This exercise is about a model of speculating against a fixed exchange rate: Two players have to decide whether they want to speculate against the peg or not. If both players speculate against, the central bank is unable to defend the peg and the speculators make a profit of $x$. If only one player speculates against the peg, the central bank will successfully defend the peg and the speculating player receives $x-1$. This gives payoffs as below
\begin{figure}[h]
       \centering
      \begin{game}{2}{2}
             \>  S \> N\\
        S  \> $x,x$ \> $x-1,0$\\
       N   \> $0,x-1$ \> $0,0$
      \end{game}
     \caption{Speculating against a currency peg}
   \end{figure}
Each player does not know $x$ but receives a signal $x_i$ which is uniformly distributed on $[x-0.1,x+0.1]$ (the two signals are independent).
   - For which values of $x$ is S a dominant action?
   - For which values of $x$ is N a dominant action?
   - Suppose player 1 observes $x_1=0.9$. What does he believe about the distribution of $x$ (assume that players had a uniform prior on $[-1,2]$ about the true state $x$ before observing $x_i$)? What does he believe about the distribution of $x_2$?
# uni on [0.8,1]; triangular on [0.7,1.1] which implies that the height of the triangle is 5 and the slope of the sides is 25
   - Suppose player 1 believes that player 2 plays $S$ whenever $x_2\geq 1$. What should player 1 do when observing signal $x_1=0.9$?
# prob(x_2>1)=7/8, hence E[u^S]\geq 0.9-7/8>0=u^N
   - Suppose player 1 believes that player 2 plays S whenever $x_2\geq \bar x_2$ (and let $\bar x_2\geq 1/2$). For which values of $x_1$ should player 1 definitely play S himself? *What is 1's best response?
# if x_1\geq \bar x_2, then prob(2 plays S)\geq 1/2 and S is best response; if x_1<\bar x_2-2*0.1 then P2 plays N for sure and N is best response; otherwise prob(x_2>\bar x_2=12.5*(x_1+2*0.1-\bar x_2)^2 and u^S>u^N iff x_1>1-12.5*(x_1+2*0.1-\bar x_2)^2; this gives the best response cutoff \bar x_1 = \bar x_2+(\sqrt{61-50\bar x_2}-6)/25
   - Can you find a symmetric Nash equilibrium in this game? (recall that a strategy is a function assigning an action to each signal)
# cut off for both equal to 1/2
   - *Show that only cutoff strategies are optimal and that the equilibrium of the previous subquestion is the unique Nash equilibrium. Show that this NE is the unique strategy surviving iterative elimination of strictly dominated strategies. (hint: check the Morris/Shin paper for a solution)
# rationalizability: first round: S when x>1, given this play S if x>
