papers/privacy/presentations/L12_global/global_games.html

<div id="outline-container-org19caa05" class="outline-3">
<h3 id="org19caa05"><span class="section-number-3">3.2</span> Exercises</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Compare equilibrium selection by the global game approach with equilibrium refinement by perfect equilibrium.</li>
</ul>

<ul class="org-ul">
<li>This exercise is about a model of speculating against a fixed exchange rate: Two players have to decide whether they want to speculate against the peg or not. If both players speculate against, the central bank is unable to defend the peg and the speculators make a profit of \(x\). If only one player speculates against the peg, the central bank will successfully defend the peg and the speculating player receives \(x-1\). This gives payoffs as below</li>
</ul>
\begin{figure}[h]
       \centering
      \begin{game}{2}{2}
             \>  S \> N\\
        S  \> $x,x$ \> $x-1,0$\\
       N   \> $0,x-1$ \> $0,0$
      \end{game}
     \caption{Speculating against a currency peg}
   \end{figure}
<p>
Each player does not know \(x\) but receives a signal \(x_i\) which is uniformly distributed on \([x-0.1,x+0.1]\) (the two signals are independent).
</p>
<ul class="org-ul">
<li>For which values of \(x\) is S a dominant action?</li>
<li>For which values of \(x\) is N a dominant action?</li>
<li>Suppose player 1 observes \(x_1=0.9\). What does he believe about the distribution of \(x\) (assume that players had a uniform prior on \([-1,2]\) about the true state \(x\) before observing \(x_i\))? What does he believe about the distribution of \(x_2\)?</li>
</ul>

<ul class="org-ul">
<li>Suppose player 1 believes that player 2 plays \(S\) whenever \(x_2\geq 1\). What should player 1 do when observing signal \(x_1=0.9\)?</li>
</ul>

<ul class="org-ul">
<li>Suppose player 1 believes that player 2 plays S whenever \(x_2\geq \bar x_2\) (and let \(\bar x_2\geq 1/2\)). For which values of \(x_1\) should player 1 definitely play S himself? *What is 1's best response?</li>
</ul>

<ul class="org-ul">
<li>Can you find a symmetric Nash equilibrium in this game? (recall that a strategy is a function assigning an action to each signal)</li>
</ul>

<ul class="org-ul">
<li>*Show that only cutoff strategies are optimal and that the equilibrium of the previous subquestion is the unique Nash equilibrium. Show that this NE is the unique strategy surviving iterative elimination of strictly dominated strategies. (hint: check the Morris/Shin paper for a solution)</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
