papers/privacy/presentations/L12_global/global_games.tex

\begin{frame}[allowframebreaks,label=]{Exercises}

\begin{itemize}
\item Compare equilibrium selection by the global game approach with equilibrium refinement by perfect equilibrium.
\end{itemize}
\begin{itemize}
\item This exercise is about a model of speculating against a fixed exchange rate: Two players have to decide whether they want to speculate against the peg or not. If both players speculate against, the central bank is unable to defend the peg and the speculators make a profit of $x$. If only one player speculates against the peg, the central bank will successfully defend the peg and the speculating player receives $x-1$. This gives payoffs as below
\end{itemize}
\begin{figure}[h]
       \centering
      \begin{game}{2}{2}
             \>  S \> N\\
        S  \> $x,x$ \> $x-1,0$\\
       N   \> $0,x-1$ \> $0,0$
      \end{game}
     \caption{Speculating against a currency peg}
   \end{figure}
Each player does not know $x$ but receives a signal $x_i$ which is uniformly distributed on $[x-0.1,x+0.1]$ (the two signals are independent).
\begin{itemize}
\item For which values of $x$ is S a dominant action?
\item For which values of $x$ is N a dominant action?
\item Suppose player 1 observes $x_1=0.9$. What does he believe about the distribution of $x$ (assume that players had a uniform prior on $[-1,2]$ about the true state $x$ before observing $x_i$)? What does he believe about the distribution of $x_2$?
\end{itemize}
\begin{itemize}
\item Suppose player 1 believes that player 2 plays $S$ whenever $x_2\geq 1$. What should player 1 do when observing signal $x_1=0.9$?
\end{itemize}
\begin{itemize}
\item Suppose player 1 believes that player 2 plays S whenever $x_2\geq \bar x_2$ (and let $\bar x_2\geq 1/2$). For which values of $x_1$ should player 1 definitely play S himself? *What is 1's best response?
\end{itemize}
\begin{itemize}
\item Can you find a symmetric Nash equilibrium in this game? (recall that a strategy is a function assigning an action to each signal)
\end{itemize}
\begin{itemize}
\item *Show that only cutoff strategies are optimal and that the equilibrium of the previous subquestion is the unique Nash equilibrium. Show that this NE is the unique strategy surviving iterative elimination of strictly dominated strategies. (hint: check the Morris/Shin paper for a solution)
\end{itemize}
\end{frame}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}